[
  {
    "date": "2025-09-02",
    "paragraphs": [
      "I have been playing the Infocom adventure Enchanter with Frotz over the last fortnight. I wanted a basic terminal based mapping tool where I could keep track of the rooms I had visited. Rather than a grid based map I thought to choose the terminal based mind mapping tool h-m-m (https://github.com/nadrad/h-m-m). This is a simple tool that allows you to create nodes and connect them together. I found it easy to use and it worked well for my needs. I created a node for each room and connected them together as I explored the game. I also added notes to each node to help me remember important details. One feature of h-m-m is the ability to export the graph as an html file ( /files/enchanter_map.html).",
      "Today I made the decision to move over to using the IFMapper tool (https://ggarra13.github.io/ifmapper/en/start.html). This is a more specialised tool for mapping interactive fiction games. The main reason to migrate was that although h-m-m worked well on Arch Linux, I found it difficult to install on other distros. Having reached Expert Enchanter rank on Enchanter I have decided to start a new text adventure and map, this time choosing Plundered Hearts."
    ]
  },
  {
    "date": "2025-08-31",
    "paragraphs": [
                    "I picked up an RP2350 Pico 2 microcontroller from the Raspberry Pi store in Cambridge last weekend with a plan to combine it with an HDMI display and mechanical keyboard I had spare. I mounted the RP2350 in an Olimex rp2040-pico-pc motherboard and flashed the Pico 2 with the Picomite BASIC core (https://geoffg.net - the PicoMiteHDMIUSB core). Although this core is compatible with the rp2040-pico-pc board I did have to blind set the HDMI support option using the keyboard via the <code>option reset olimexusb</code> command. This set the necessary options to connect to the display via the Olimex HDMI port, after which I reset the Olimex board.",
                    "The https://thebackshed.com forum provided useful information on how to implement this setup. For software I found the Clockwork Pi forum useful. As the deck was running similar BASIC firmware to the Clockwork Pi PicoCalc handheld device, I was able to use the software written for this platform."
    ],
    "images": [
      { "src": "files/images/picomite_deck_open.png", "alt": "An open computer case shows a Raspberry Pico RP2350, an HDMI display and a black keyboard" },
      { "src": "files/images/picomite_deck_closed.png", "alt": "An closed computer case shows an HDMI display and a black keyboard" }
    ]
  },
  {
    "date": "2025-08-27",
    "paragraphs": [
                    "An interesting You Tube film from 1972 of the Barbican estate in London. The Barbican is a brutalist residential complex in the centre of London, containing shops, gardens, restaurants, theatres and gallery spaces. I worked nearby during the several years I lived in London and would spend my lunch breaks either in the garden, restaurant or basement. Shown here, the strikingly orange painted basement always provided a quiet, calm space from the busy city. I would sit here coding my own projects or playing Discworld MUD.",
                    "In the evenings it was a music and theatre venue. I remember seeing the Residents play here with my dear friend Andy. On Fridays, I would treat myself to a roast duck dinner in the restaurant and sometimes a book from it's bookshop. I never returned after the Pandemic, maybe it had changed as I had. I would soon leave London and start a new chapter of my life."
    ],
    "youtube": "https://youtu.be/vvXpvH99tic?feature=shared",
    "images": [
      { "src": "files/images/barbican_orange_hall.jpg", "alt": "The orange basement of the Barbican Centre" }
    ]
  },
  {
    "date": "2025-08-26",
    "text": "A small project to create a storage display shelf for my wall. I found a bare wooden shelf unit from a craft outlet and stained it for a mahogany look. I also gave the shelves a coat of linseed oil to help preserve them. I am quite happy with the results.",
    "images": [
      { "src": "files/images/display_shelf.jpg", "alt": "A mahogany display shelf containing ephemera" }
    ]
  },
  {
    "date": "2025-08-25",
    "text": "Two creators that have been an inspiration are Carol Shaw (Atari - River Raid) and Amy Briggs (Infocom - Plundered Hearts). I have watched some interesting films about Infocom recently. Text adventures were a significant part of my youth. I would recommend The Infocom documentary, especially as it contains an interview with Amy Briggs.",
    "youtube": "https://youtu.be/OXNLWy7rwH4?feature=shared"
  }
]
